Ac6Embedded/svd-microchip/PIC32CZ_CA70/PIC32CZ2051CA70100.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>MCAN0</name>
         <version>11273N</version>
         <description>Controller Area Network</description>
         <groupName>MCAN</groupName>
         <prependToName>MCAN_</prependToName>
         <baseAddress>0x40030000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xFC</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>MCAN0_INT0</name>
            <description>MCAN Controller 0 Interrupt 0</description>
            <value>35</value>
         </interrupt>
         <interrupt>
            <name>MCAN0_INT1</name>
            <description>MCAN Controller 0 Interrupt 1</description>
            <value>36</value>
         </interrupt>
         <registers>
            <register>
               <name>CREL</name>
               <description>Core Release Register</description>
               <addressOffset>0x00</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DAY</name>
                     <description>Timestamp Day</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MON</name>
                     <description>Timestamp Month</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>YEAR</name>
                     <description>Timestamp Year</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SUBSTEP</name>
                     <description>Sub-step of Core Release</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>STEP</name>
                     <description>Step of Core Release</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>REL</name>
                     <description>Core Release</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ENDN</name>
               <description>Endian Register</description>
               <addressOffset>0x04</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ETV</name>
                     <description>Endianness Test Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CUST</name>
               <description>Customer Register</description>
               <addressOffset>0x08</addressOffset>
               <fields>
                  <field>
                     <name>CSV</name>
                     <description>Customer-specific Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DBTP</name>
               <description>Data Bit Timing and Prescaler Register</description>
               <addressOffset>0x0C</addressOffset>
               <fields>
                  <field>
                     <name>DSJW</name>
                     <description>Data (Re) Synchronization Jump Width</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>DTSEG2</name>
                     <description>Data Time Segment After Sample Point</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DTSEG1</name>
                     <description>Data Time Segment Before Sample Point</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DBRP</name>
                     <description>Data Bit Rate Prescaler</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>TDC</name>
                     <description>Transmitter Delay Compensation</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TDCSelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Transmitter Delay Compensation disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Transmitter Delay Compensation enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TEST</name>
               <description>Test Register</description>
               <addressOffset>0x10</addressOffset>
               <fields>
                  <field>
                     <name>LBCK</name>
                     <description>Loop Back Mode (read/write)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>LBCKSelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Reset value. Loop Back mode is disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Loop Back mode is enabled (see Section 6.1.9).</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TX</name>
                     <description>Control of Transmit Pin (read/write)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TXSelect</name>
                        <enumeratedValue>
                           <name>RESET</name>
                           <description>Reset value, CANTX controlled by the CAN Core, updated at the end of the CAN bit time.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SAMPLE_POINT_MONITORING</name>
                           <description>Sample Point can be monitored at pin CANTX.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DOMINANT</name>
                           <description>Dominant ('0') level at pin CANTX.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RECESSIVE</name>
                           <description>Recessive ('1') at pin CANTX.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RX</name>
                     <description>Receive Pin (read-only)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RWD</name>
               <description>RAM Watchdog Register</description>
               <addressOffset>0x14</addressOffset>
               <fields>
                  <field>
                     <name>WDC</name>
                     <description>Watchdog Configuration (read/write)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>WDV</name>
                     <description>Watchdog Value (read-only)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CCCR</name>
               <description>CC Control Register</description>
               <addressOffset>0x18</addressOffset>
               <fields>
                  <field>
                     <name>INIT</name>
                     <description>Initialization (read/write)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>INITSelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Normal operation.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Initialization is started.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CCE</name>
                     <description>Configuration Change Enable (read/write, write protection)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>CCESelect</name>
                        <enumeratedValue>
                           <name>PROTECTED</name>
                           <description>The processor has no write access to the protected configuration registers.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CONFIGURABLE</name>
                           <description>The processor has write access to the protected configuration registers (while MCAN_CCCR.INIT = '1').</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ASM</name>
                     <description>Restricted Operation Mode (read/write, write protection against '1')</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>ASMSelect</name>
                        <enumeratedValue>
                           <name>NORMAL</name>
                           <description>Normal CAN operation.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESTRICTED</name>
                           <description>Restricted Operation mode active.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CSA</name>
                     <description>Clock Stop Acknowledge (read-only)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSR</name>
                     <description>Clock Stop Request (read/write)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>CSRSelect</name>
                        <enumeratedValue>
                           <name>NO_CLOCK_STOP</name>
                           <description>No clock stop is requested.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLOCK_STOP</name>
                           <description>Clock stop requested. When clock stop is requested, first INIT and then CSA will be set after all pend-ing transfer requests have been completed and the CAN bus reached idle.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MON</name>
                     <description>Bus Monitoring Mode (read/write, write protection against '1')</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>MONSelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Bus Monitoring mode is disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Bus Monitoring mode is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DAR</name>
                     <description>Disable Automatic Retransmission (read/write, write protection)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>DARSelect</name>
                        <enumeratedValue>
                           <name>AUTO_RETX</name>
                           <description>Automatic retransmission of messages not transmitted successfully enabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_AUTO_RETX</name>
                           <description>Automatic retransmission disabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TEST</name>
                     <description>Test Mode Enable (read/write, write protection against '1')</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TESTSelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Normal operation, MCAN_TEST register holds reset values.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Test mode, write access to MCAN_TEST register enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FDOE</name>
                     <description>CAN FD Operation Enable (read/write, write protection)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>FDOESelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>FD operation disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>FD operation enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BRSE</name>
                     <description>Bit Rate Switching Enable (read/write, write protection)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>BRSESelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Bit rate switching for transmissions disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Bit rate switching for transmissions enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PXHD</name>
                     <description>Protocol Exception Event Handling (read/write, write protection)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EFBI</name>
                     <description>Edge Filtering during Bus Integration (read/write, write protection)</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXP</name>
                     <description>Transmit Pause (read/write, write protection)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NISO</name>
                     <description>Non-ISO Operation</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NBTP</name>
               <description>Nominal Bit Timing and Prescaler Register</description>
               <addressOffset>0x1C</addressOffset>
               <fields>
                  <field>
                     <name>NTSEG2</name>
                     <description>Nominal Time Segment After Sample Point</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>NTSEG1</name>
                     <description>Nominal Time Segment Before Sample Point</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>NBRP</name>
                     <description>Nominal Bit Rate Prescaler</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>NSJW</name>
                     <description>Nominal (Re) Synchronization Jump Width</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
