Ac6Embedded/svd-microchip/PIC32CZ_CA70/PIC32CZ2051CA70100.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="UART0">
         <name>UART1</name>
         <baseAddress>0x400E0A00</baseAddress>
         <interrupt>
            <name>UART1</name>
            <description>UART 1</description>
            <value>8</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="UART0">
         <name>UART2</name>
         <baseAddress>0x400E1A00</baseAddress>
         <interrupt>
            <name>UART2</name>
            <description>UART 2</description>
            <value>44</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="UART0">
         <name>UART3</name>
         <baseAddress>0x400E1C00</baseAddress>
         <interrupt>
            <name>UART3</name>
            <description>UART 3</description>
            <value>45</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="UART0">
         <name>UART4</name>
         <baseAddress>0x400E1E00</baseAddress>
         <interrupt>
            <name>UART4</name>
            <description>UART 4</description>
            <value>46</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>USART0</name>
         <version>6089ZW</version>
         <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
         <groupName>USART</groupName>
         <prependToName>USART_</prependToName>
         <baseAddress>0x40024000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xEC</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>USART0</name>
            <description>USART 0</description>
            <value>13</value>
         </interrupt>
         <registers>
            <register>
               <name>US_CR_USART_MODE</name>
               <description>Control Register</description>
               <addressOffset>0x0000</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RSTRX</name>
                     <description>Reset Receiver</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSTTX</name>
                     <description>Reset Transmitter</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXEN</name>
                     <description>Receiver Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXDIS</name>
                     <description>Receiver Disable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXEN</name>
                     <description>Transmitter Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXDIS</name>
                     <description>Transmitter Disable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSTSTA</name>
                     <description>Reset Status Bits</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STTBRK</name>
                     <description>Start Break</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STPBRK</name>
                     <description>Stop Break</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STTTO</name>
                     <description>Clear TIMEOUT Flag and Start Timeout After Next Character Received</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SENDA</name>
                     <description>Send Address</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSTIT</name>
                     <description>Reset Iterations</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSTNACK</name>
                     <description>Reset Non Acknowledge</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RETTO</name>
                     <description>Start Timeout Immediately</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DTREN</name>
                     <description>Data Terminal Ready Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DTRDIS</name>
                     <description>Data Terminal Ready Disable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTSEN</name>
                     <description>Request to Send Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTSDIS</name>
                     <description>Request to Send Disable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>US_CR_SPI_MODE</name>
               <description>Control Register</description>
               <alternateRegister>US_CR_USART_MODE</alternateRegister>
               <addressOffset>0x0000</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RSTRX</name>
                     <description>Reset Receiver</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSTTX</name>
                     <description>Reset Transmitter</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXEN</name>
                     <description>Receiver Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXDIS</name>
                     <description>Receiver Disable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXEN</name>
                     <description>Transmitter Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXDIS</name>
                     <description>Transmitter Disable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSTSTA</name>
                     <description>Reset Status Bits</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FCS</name>
                     <description>Force SPI Chip Select</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCS</name>
                     <description>Release SPI Chip Select</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>US_CR_LIN_MODE</name>
               <description>Control Register</description>
               <alternateRegister>US_CR_USART_MODE</alternateRegister>
               <addressOffset>0x0000</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RSTRX</name>
                     <description>Reset Receiver</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSTTX</name>
                     <description>Reset Transmitter</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXEN</name>
                     <description>Receiver Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXDIS</name>
                     <description>Receiver Disable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXEN</name>
                     <description>Transmitter Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXDIS</name>
                     <description>Transmitter Disable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSTSTA</name>
                     <description>Reset Status Bits</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LINABT</name>
                     <description>Abort LIN Transmission</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LINWKUP</name>
                     <description>Send LIN Wakeup Signal</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
